import React from 'react';

function WhatKnowBody() {
    return (
        <div>
            <div>
                <h2>HTML / CSS</h2>
                <p>Знаю семантику тегов и как ею пользоваться,
                при написании html кода думаю о том, как его я потом буду верстать
                и придумываю адекватные название классов, так же в команде с seo разработчиком
                мне приходилось использовать seo-теги в работе:
                </p>
                <ul>
                    <li>OG теги</li>
                    <li>Адекватные названия классов</li>
                </ul>
                <p>Могу спокойно сверстать адаптированный макет сайта используя современные
                инструменты для работы с css, такие как:
                    </p>
                <ul>
                    <li>Bootstrap</li>
                    <li>Препроцессор scss</li>
                    <li>Flexbox</li>
                    <li>Методология БЭМ</li>
                </ul>
                <b>Хочу изучить:</b>
                <ul>
                    <li>Кроссбраузерность</li>
                    <li>Pixel perfect</li>
                </ul>
                <hr></hr>
            </div>
            <div>
                <h2>JavaScript</h2>
                <p>Знаю основы данного языка программирования:</p>
                <ul>
                    <li>Типы данных</li>
                    <li>Массивы, а так же их методы</li>
                    <li>Функции(стрелочные в том числе)</li>
                    <li>Циклы</li>
                </ul>
                <b>Хочу изучить:</b>
                <ul>
                    <li>jQuery</li>
                </ul>
                <hr></hr>
            </div>
            <div>
                <h2>React</h2>
                <p>Я еще изучаю данную библиотеку, но уже знаю и
                     практикую некоторые react инструменты, а именно:
                </p>
                <ul>
                    <li>Состояние и методы жизненного цикла</li>
                    <li>Использование хуков в функциональных компонентах</li>
                    <li>Компоненты и пропсы</li>
                    <li>CSS модули</li>
                    <li>Использования библиотек компонентов: Bootstrap, Route</li>
                </ul>
                <b>Хочу изучить:</b>
                <ul>
                    <li>Redux</li>
                    <li>Saga</li>
                    <li>CSS in JS</li>
                    <li>TypeScript</li>
                </ul>
            </div>
        </div>
    )
}

export default WhatKnowBody;