import React from 'react';

function WhatKnowBody() {
    return (
        <div>
            <div>
                <h2>HTML / CSS</h2>
                <p>Знаю семантику тегов и как ею пользоваться,
                при написании html кода думаю о том, как его я потом буду верстать
                и придумываю адекватные название классов, так же в команде с seo разработчиком
                мне приходилось использовать seo-теги в работе:
                    </p>
                <ul>
                    <li>Основные теги</li>
                    <li>Мета теги</li>
                </ul>
                <p>Могу спокойно сверстать адаптированный макет сайта используя современные
                инструменты для работы с css, такие как:
                    </p>
                <ul>
                    <li>Bootstrap</li>
                    <li>Препроцессор scss</li>
                    <li>Flexbox</li>
                    <li>Методология БЭМ</li>
                </ul>
                <b>Хочу изучить:</b>
                <ul>
                    <li>Кроссбраузерность</li>
                    <li>Pixel perfect</li>
                </ul>
            </div>
            <div>
                <h2>JavaScript</h2>
                <p>Знаю основы данного языка программирования:</p>
                <ul>
                    <li>Типы данных</li>
                    <li>Массивы, а так же их методы</li>
                    <li>Функции(стрелочные в том числе)</li>
                    <li>Циклы</li>
                </ul>
                <b>Хочу изучить:</b>
                <ul>
                    <li>React</li>
                    <li>jQuery</li>
                </ul>
            </div>
        </div>
    )
}

export default WhatKnowBody;